#### Series Data Structur (1D)

In [1]:
import pandas as pd

#create a 1d array with pandas
s1 = pd.Series([11, 20, 40, 13, 45, 46])
print(s1)

print(s1.index)

print(s1.dtype) #type

print(s1[1]) #first value

0    11
1    20
2    40
3    13
4    45
5    46
dtype: int64
RangeIndex(start=0, stop=6, step=1)
int64
20

In [12]:
s2 = pd.Series([11, 20, 50, 13, 45, 46], index=["a", "b", "c", "d", "e", "f"])
print(s2.index) #index is not a variable
print(s2["c"]) #call the index value (40)
print(s2["b":"d"])

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')
50
b    20
c    50
d    13
dtype: int64

In [3]:
list1 = [1, 2, 3, 4, 5]
print(list1)
print(list1*3)

[1, 2, 3, 4, 5]
[1, 2, 3, 4, 5, 1, 2, 3, 4, 5, 1, 2, 3, 4, 5]

In [4]:
s3 = pd.Series([1, 2, 3, 4, 5])
print(s3)
s3 = s3 + 10 #does not work with a list
print(s3)
print(s3*3)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    11
1    12
2    13
3    14
4    15
dtype: int64
0    33
1    36
2    39
3    42
4    45
dtype: int64

In [5]:
s4 = pd.Series([1, 2, 3, 4, 5])
print(s3+s4)
print(s3*s4)
print(4 in s3)

0    12
1    14
2    16
3    18
4    20
dtype: int64
0    11
1    24
2    39
3    56
4    75
dtype: int64
True

In [6]:
s5 = pd.Series(3, index = range(100))
print(s5)

0     3
1     3
2     3
3     3
4     3
     ..
95    3
96    3
97    3
98    3
99    3
Length: 100, dtype: int64

In [7]:
s6 = pd.Series(4, index=["a", "b", "c", "d", "e"])
print(s6)

a    4
b    4
c    4
d    4
e    4
dtype: int64

In [13]:
s2 > 10

a    True
b    True
c    True
d    True
e    True
f    True
dtype: bool

In [14]:
s2 > 40

a    False
b    False
c     True
d    False
e     True
f     True
dtype: bool

In [15]:
myfilter = s2>40
print(myfilter)

a    False
b    False
c     True
d    False
e     True
f     True
dtype: bool

In [16]:
s2[myfilter]

c    50
e    45
f    46
dtype: int64

In [17]:
s2[s2>40]

c    50
e    45
f    46
dtype: int64

In [18]:
s2[s2>s2.mean()] #whole mean-value for s2 where s2 is bigger

c    50
e    45
f    46
dtype: int64

In [20]:
#how to make a pd.series out of a dictionary
profile = {"ID": 123, "Name": "David", "Sex": "Male", "Age": 34}

s7 = pd.Series(profile)
print(s7)

print()

print(s7["Name"])

ID        123
Name    David
Sex      Male
Age        34
dtype: object

David

In [22]:
#how to make a pd.series out of a dictionary2
grades = {"Mary": 91, "David": 74, "John": 91}
s8 = pd.Series(grades, name="Grades") #add: name of the series
print(s8)

Mary     91
David    74
John     91
Name: Grades, dtype: int64

#### DataFrame Data Structure (2D)

In [23]:
import pandas as pd

In [29]:
dic1 = {"Name": ["David", "John", "Marta", "Dianna"], "Age":[41,19,33,24], "Weight":[85,76,67,56]}
df = pd.DataFrame(dic1, index=["a", "b", "c", "d"]) #DataFrame: makes a dataframe out of the dictionary
print(df)

print(df.index)
print(df.columns)

     Name  Age  Weight
a   David   41      85
b    John   19      76
c   Marta   33      67
d  Dianna   24      56
Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['Name', 'Age', 'Weight'], dtype='object')

In [30]:
df["Name"] #result: 1 dim object in a single column

a     David
b      John
c     Marta
d    Dianna
Name: Name, dtype: object

In [31]:
df[["Name", "Age"]]

     Name  Age
a   David   41
b    John   19
c   Marta   33
d  Dianna   24

In [32]:
df[0:2] #slicing in a dataframe

    Name  Age  Weight
a  David   41      85
b   John   19      76

In [33]:
df[:3]

    Name  Age  Weight
a  David   41      85
b   John   19      76
c  Marta   33      67

In [34]:
df["a":"b"]

    Name  Age  Weight
a  David   41      85
b   John   19      76

In [35]:
df[["Name", "Age"]][:3]

    Name  Age
a  David   41
b   John   19
c  Marta   33

In [36]:
df[["Name", "Age"]]["a":"b"]

    Name  Age
a  David   41
b   John   19

In [40]:
#access columns
df.Age

a    41
b    19
c    33
d    24
Name: Age, dtype: int64

In [41]:
df.Name

a     David
b      John
c     Marta
d    Dianna
Name: Name, dtype: object

In [43]:
#show the type
type(df["Age"])

pandas.core.series.Series

In [44]:
df["Name"]

a     David
b      John
c     Marta
d    Dianna
Name: Name, dtype: object

In [47]:
#df.loc[what rows to filter, what columns to filter]
df.loc[:, "Name"]

a     David
b      John
c     Marta
d    Dianna
Name: Name, dtype: object

In [48]:
df.loc[:, ["Name", "Age"]]

     Name  Age
a   David   41
b    John   19
c   Marta   33
d  Dianna   24

In [49]:
df.loc[["a", "b"], ["Name", "Age"]]

    Name  Age
a  David   41
b   John   19

In [57]:
df.loc["a":"b", "Name":"Weight"]

    Name  Age  Weight
a  David   41      85
b   John   19      76

In [52]:
df.iloc[1, : ]

Name      John
Age         19
Weight      76
Name: b, dtype: object

In [53]:
df.iloc[1]

Name      John
Age         19
Weight      76
Name: b, dtype: object

In [54]:
df.iloc[1:3, : ]

    Name  Age  Weight
b   John   19      76
c  Marta   33      67

In [55]:
df

     Name  Age  Weight
a   David   41      85
b    John   19      76
c   Marta   33      67
d  Dianna   24      56

In [58]:
df.iloc[:,[0,2]]

     Name  Weight
a   David      85
b    John      76
c   Marta      67
d  Dianna      56

In [59]:
df.iloc[:, 0:2]

     Name  Age
a   David   41
b    John   19
c   Marta   33
d  Dianna   24

In [60]:
df.iloc[[0,1,2], :]

    Name  Age  Weight
a  David   41      85
b   John   19      76
c  Marta   33      67

In [61]:
df.iloc[0:2, :]

    Name  Age  Weight
a  David   41      85
b   John   19      76